app/Controllers/Producto.php

SELECT *
FROM `productos`
 LIMIT 490, 10
SELECT COUNT(*) AS `numrows`
FROM `productos`
---
    public function index()
    {
        $model = model(ProductoModel::class);

        $buscarPor = $this->request->getVar('buscar_por') ?? '';
        $buscar = $this->request->getVar('buscar') ?? '';

        if (!empty($buscarPor) && !empty($buscar)) {

            $productos = $model->select('id, nombre, sku, precio, stock')
                ->where([$buscarPor => $buscar])
                ->paginate(10);

            $data = [
                'productos' => $productos,
                'pager' => $model->pager,
            ];

            return view('productos/index', $data);

        } else {

            $productos = $model->paginate(10);

SELECT *
FROM `productos`
WHERE `productos`.`id` = '499'
---
    public function vistaEditar($id) {

        $producto = model(ProductoModel::class);
        $datos = $producto->find($id);